{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Ruitk",
			"Children": [
				{
					"Source":
					{
						"Text": "<UMG: CreateWidget failed>"
					},
					"Translation":
					{
						"Text": "<UMG: CreateWidget failed>"
					},
					"Key": "UmgFailed"
				},
				{
					"Source":
					{
						"Text": "<UMG: class/world unset>"
					},
					"Translation":
					{
						"Text": "<UMG: class/world unset>"
					},
					"Key": "UmgMissing"
				},
				{
					"Source":
					{
						"Text": "[Reactive UI Toolkit screen: {0}]"
					},
					"Translation":
					{
						"Text": "[Reactive UI Toolkit screen: {0}]"
					},
					"Key": "ActivatableDesignTime"
				},
				{
					"Source":
					{
						"Text": "[Reactive UI Toolkit: '{0}' is ambiguous — use a qualified id: {1}]"
					},
					"Translation":
					{
						"Text": "[Reactive UI Toolkit: '{0}' is ambiguous — use a qualified id: {1}]"
					},
					"Key": "HostAmbiguous"
				},
				{
					"Source":
					{
						"Text": "[Reactive UI Toolkit: '{0}' is not a registered component]"
					},
					"Translation":
					{
						"Text": "[Reactive UI Toolkit: '{0}' is not a registered component]"
					},
					"Key": "HostUnknown"
				},
				{
					"Source":
					{
						"Text": "[Reactive UI Toolkit: {0}]"
					},
					"Translation":
					{
						"Text": "[Reactive UI Toolkit: {0}]"
					},
					"Key": "HostDesignTime"
				}
			]
		},
		{
			"Namespace": "RuitkDemo",
			"Children": [
				{
					"Source":
					{
						"Text": "Pop the screen (deactivates it)"
					},
					"Translation":
					{
						"Text": "Pop the screen (deactivates it)"
					},
					"Key": "StackPop"
				},
				{
					"Source":
					{
						"Text": "Push a screen (activates it)"
					},
					"Translation":
					{
						"Text": "Push a screen (activates it)"
					},
					"Key": "StackPush"
				},
				{
					"Source":
					{
						"Text": "▲ A REAL UCommonActivatableWidgetStack. The screen on it is a URuitkActivatableScreen hosting the ActivationProbe component:"
					},
					"Translation":
					{
						"Text": "▲ A REAL UCommonActivatableWidgetStack. The screen on it is a URuitkActivatableScreen hosting the ActivationProbe component:"
					},
					"Key": "StackCaption"
				},
				{
					"Source":
					{
						"Text": "▲ A hand-built UMG UserWidget. The panel below it is a URuitkHostWidget — OUR component, mounted INSIDE this UMG tree by name:"
					},
					"Translation":
					{
						"Text": "▲ A hand-built UMG UserWidget. The panel below it is a URuitkHostWidget — OUR component, mounted INSIDE this UMG tree by name:"
					},
					"Key": "UmgHostCaption"
				},
				{
					"Source":
					{
						"Text": "▲ This is a real UMG UserWidget, hosted inside the Reactive UI Toolkit tree"
					},
					"Translation":
					{
						"Text": "▲ This is a real UMG UserWidget, hosted inside the Reactive UI Toolkit tree"
					},
					"Key": "UmgInner"
				},
				{
					"Source":
					{
						"Text": "▲ UMG TextBlock via FieldNotify: {0}"
					},
					"Translation":
					{
						"Text": "▲ UMG TextBlock via FieldNotify: {0}"
					},
					"Key": "VmBound"
				}
			]
		},
		{
			"Namespace": "Uetkx",
			"Subnamespaces": [
				{
					"Namespace": "AcceptanceLab",
					"Children": [
						{
							"Source":
							{
								"Text": "   HIGH"
							},
							"Translation":
							{
								"Text": "   HIGH"
							},
							"Key": "AcceptanceLab_10"
						},
						{
							"Source":
							{
								"Text": "   LOW"
							},
							"Translation":
							{
								"Text": "   LOW"
							},
							"Key": "AcceptanceLab_8"
						},
						{
							"Source":
							{
								"Text": "   MID"
							},
							"Translation":
							{
								"Text": "   MID"
							},
							"Key": "AcceptanceLab_9"
						},
						{
							"Source":
							{
								"Text": "   a bare `=` markup value"
							},
							"Translation":
							{
								"Text": "   a bare `=` markup value"
							},
							"Key": "AcceptanceLab_1"
						},
						{
							"Source":
							{
								"Text": "   short-circuit chip (uncheck 3 to hide me)"
							},
							"Translation":
							{
								"Text": "   short-circuit chip (uncheck 3 to hide me)"
							},
							"Key": "AcceptanceLab_21"
						},
						{
							"Source":
							{
								"Text": "   ternary: mounted"
							},
							"Translation":
							{
								"Text": "   ternary: mounted"
							},
							"Key": "AcceptanceLab_22"
						},
						{
							"Source":
							{
								"Text": "   ternary: not yet"
							},
							"Translation":
							{
								"Text": "   ternary: not yet"
							},
							"Key": "AcceptanceLab_23"
						},
						{
							"Source":
							{
								"Text": "+1"
							},
							"Translation":
							{
								"Text": "+1"
							},
							"Key": "AcceptanceLab_3"
						},
						{
							"Source":
							{
								"Text": "10. Markup as a value (FRuitkNode locals, spliced below)"
							},
							"Translation":
							{
								"Text": "10. Markup as a value (FRuitkNode locals, spliced below)"
							},
							"Key": "AcceptanceLab_20"
						},
						{
							"Source":
							{
								"Text": "3. dim the label when checked"
							},
							"Translation":
							{
								"Text": "3. dim the label when checked"
							},
							"Key": "AcceptanceLab_6"
						},
						{
							"Source":
							{
								"Text": "4. @if / @elif / @else (drag the slider above)"
							},
							"Translation":
							{
								"Text": "4. @if / @elif / @else (drag the slider above)"
							},
							"Key": "AcceptanceLab_7"
						},
						{
							"Source":
							{
								"Text": "5. @for over a keyed list"
							},
							"Translation":
							{
								"Text": "5. @for over a keyed list"
							},
							"Key": "AcceptanceLab_11"
						},
						{
							"Source":
							{
								"Text": "6. @while (bounded, 3 rows)"
							},
							"Translation":
							{
								"Text": "6. @while (bounded, 3 rows)"
							},
							"Key": "AcceptanceLab_12"
						},
						{
							"Source":
							{
								"Text": "7. @match → Details tab"
							},
							"Translation":
							{
								"Text": "7. @match → Details tab"
							},
							"Key": "AcceptanceLab_17"
						},
						{
							"Source":
							{
								"Text": "7. @match → Overview tab"
							},
							"Translation":
							{
								"Text": "7. @match → Overview tab"
							},
							"Key": "AcceptanceLab_16"
						},
						{
							"Source":
							{
								"Text": "7. @match → default (Other)"
							},
							"Translation":
							{
								"Text": "7. @match → default (Other)"
							},
							"Key": "AcceptanceLab_18"
						},
						{
							"Source":
							{
								"Text": "8. Imported sub-components (LabCard)"
							},
							"Translation":
							{
								"Text": "8. Imported sub-components (LabCard)"
							},
							"Key": "AcceptanceLab_19"
						},
						{
							"Source":
							{
								"Text": "Acceptance Lab — one screen to test them all"
							},
							"Translation":
							{
								"Text": "Acceptance Lab — one screen to test them all"
							},
							"Key": "AcceptanceLab_2"
						},
						{
							"Source":
							{
								"Text": "Details"
							},
							"Translation":
							{
								"Text": "Details"
							},
							"Key": "AcceptanceLab_14"
						},
						{
							"Source":
							{
								"Text": "Other"
							},
							"Translation":
							{
								"Text": "Other"
							},
							"Key": "AcceptanceLab_15"
						},
						{
							"Source":
							{
								"Text": "Overview"
							},
							"Translation":
							{
								"Text": "Overview"
							},
							"Key": "AcceptanceLab_13"
						},
						{
							"Source":
							{
								"Text": "Reset"
							},
							"Translation":
							{
								"Text": "Reset"
							},
							"Key": "AcceptanceLab_4"
						},
						{
							"Source":
							{
								"Text": "Type here — the mirror below tracks you"
							},
							"Translation":
							{
								"Text": "Type here — the mirror below tracks you"
							},
							"Key": "AcceptanceLab_5"
						}
					]
				},
				{
					"Namespace": "ClickCounter",
					"Children": [
						{
							"Source":
							{
								"Text": "+"
							},
							"Translation":
							{
								"Text": "+"
							},
							"Key": "ClickCounter_1"
						},
						{
							"Source":
							{
								"Text": "-"
							},
							"Translation":
							{
								"Text": "-"
							},
							"Key": "ClickCounter_2"
						},
						{
							"Source":
							{
								"Text": "Reset"
							},
							"Translation":
							{
								"Text": "Reset"
							},
							"Key": "ClickCounter_3"
						}
					]
				},
				{
					"Namespace": "CommonUiDemo",
					"Children": [
						{
							"Source":
							{
								"Text": "1. The hooks, driven by a toggle (works headless -- ProvideContext stands in):"
							},
							"Translation":
							{
								"Text": "1. The hooks, driven by a toggle (works headless -- ProvideContext stands in):"
							},
							"Key": "CommonUiDemo_2"
						},
						{
							"Source":
							{
								"Text": "2. THE REAL THING -- our screen pushed onto a real CommonUI activatable stack:"
							},
							"Translation":
							{
								"Text": "2. THE REAL THING -- our screen pushed onto a real CommonUI activatable stack:"
							},
							"Key": "CommonUiDemo_4"
						},
						{
							"Source":
							{
								"Text": "CommonUI -- activation feeds us"
							},
							"Translation":
							{
								"Text": "CommonUI -- activation feeds us"
							},
							"Key": "CommonUiDemo_1"
						},
						{
							"Source":
							{
								"Text": "Toggle activation"
							},
							"Translation":
							{
								"Text": "Toggle activation"
							},
							"Key": "CommonUiDemo_3"
						}
					]
				},
				{
					"Namespace": "ContextDemo",
					"Children": [
						{
							"Source":
							{
								"Text": "Context Demo (toggle theme to see consumers update)"
							},
							"Translation":
							{
								"Text": "Context Demo (toggle theme to see consumers update)"
							},
							"Key": "ContextDemo_1"
						}
					]
				},
				{
					"Namespace": "CustomDraw",
					"Children": [
						{
							"Source":
							{
								"Text": "1. Polygon -- redraws when 'sides' state changes"
							},
							"Translation":
							{
								"Text": "1. Polygon -- redraws when 'sides' state changes"
							},
							"Key": "CustomDraw_2"
						},
						{
							"Source":
							{
								"Text": "2. Tinted quad -- toggles color"
							},
							"Translation":
							{
								"Text": "2. Tinted quad -- toggles color"
							},
							"Key": "CustomDraw_5"
						},
						{
							"Source":
							{
								"Text": "3. Stable callback + RedrawKey -- repaint on demand"
							},
							"Translation":
							{
								"Text": "3. Stable callback + RedrawKey -- repaint on demand"
							},
							"Key": "CustomDraw_7"
						},
						{
							"Source":
							{
								"Text": "Add side"
							},
							"Translation":
							{
								"Text": "Add side"
							},
							"Key": "CustomDraw_3"
						},
						{
							"Source":
							{
								"Text": "Custom Rendering Demo (RuitkCanvas draw_fn)"
							},
							"Translation":
							{
								"Text": "Custom Rendering Demo (RuitkCanvas draw_fn)"
							},
							"Key": "CustomDraw_1"
						},
						{
							"Source":
							{
								"Text": "Reset"
							},
							"Translation":
							{
								"Text": "Reset"
							},
							"Key": "CustomDraw_4"
						},
						{
							"Source":
							{
								"Text": "Shuffle(bump RedrawKey)"
							},
							"Translation":
							{
								"Text": "Shuffle(bump RedrawKey)"
							},
							"Key": "CustomDraw_8"
						},
						{
							"Source":
							{
								"Text": "Toggle color"
							},
							"Translation":
							{
								"Text": "Toggle color"
							},
							"Key": "CustomDraw_6"
						}
					]
				},
				{
					"Namespace": "DoomFace",
					"Children": [
						{
							"Source":
							{
								"Text": "DOOMGUY"
							},
							"Translation":
							{
								"Text": "DOOMGUY"
							},
							"Key": "DoomFace_1"
						}
					]
				},
				{
					"Namespace": "DoomGameScreen",
					"Children": [
						{
							"Source":
							{
								"Text": "LEVEL COMPLETE"
							},
							"Translation":
							{
								"Text": "LEVEL COMPLETE"
							},
							"Key": "DoomGameScreen_4"
						},
						{
							"Source":
							{
								"Text": "Main menu"
							},
							"Translation":
							{
								"Text": "Main menu"
							},
							"Key": "DoomGameScreen_6"
						},
						{
							"Source":
							{
								"Text": "Main menu"
							},
							"Translation":
							{
								"Text": "Main menu"
							},
							"Key": "DoomGameScreen_3"
						},
						{
							"Source":
							{
								"Text": "Next level"
							},
							"Translation":
							{
								"Text": "Next level"
							},
							"Key": "DoomGameScreen_5"
						},
						{
							"Source":
							{
								"Text": "Restart level"
							},
							"Translation":
							{
								"Text": "Restart level"
							},
							"Key": "DoomGameScreen_2"
						},
						{
							"Source":
							{
								"Text": "YOU DIED"
							},
							"Translation":
							{
								"Text": "YOU DIED"
							},
							"Key": "DoomGameScreen_1"
						}
					]
				},
				{
					"Namespace": "DoomHUD",
					"Children": [
						{
							"Source":
							{
								"Text": "AMMO"
							},
							"Translation":
							{
								"Text": "AMMO"
							},
							"Key": "DoomHUD_1"
						},
						{
							"Source":
							{
								"Text": "ARMS"
							},
							"Translation":
							{
								"Text": "ARMS"
							},
							"Key": "DoomHUD_3"
						},
						{
							"Source":
							{
								"Text": "HEALTH"
							},
							"Translation":
							{
								"Text": "HEALTH"
							},
							"Key": "DoomHUD_2"
						}
					]
				},
				{
					"Namespace": "DoomMainMenu",
					"Children": [
						{
							"Source":
							{
								"Text": "(in .uetkx)"
							},
							"Translation":
							{
								"Text": "(in .uetkx)"
							},
							"Key": "DoomMainMenu_2"
						},
						{
							"Source":
							{
								"Text": "DIFFICULTY  —"
							},
							"Translation":
							{
								"Text": "DIFFICULTY  —"
							},
							"Key": "DoomMainMenu_4"
						},
						{
							"Source":
							{
								"Text": "DOOM"
							},
							"Translation":
							{
								"Text": "DOOM"
							},
							"Key": "DoomMainMenu_1"
						},
						{
							"Source":
							{
								"Text": "EPISODE 1   —"
							},
							"Translation":
							{
								"Text": "EPISODE 1   —"
							},
							"Key": "DoomMainMenu_3"
						},
						{
							"Source":
							{
								"Text": "WASD = move    |    Mouse = look    |    Click = shoot    |    1-7 = weapons    |    E = use door    |    Shift = run"
							},
							"Translation":
							{
								"Text": "WASD = move    |    Mouse = look    |    Click = shoot    |    1-7 = weapons    |    E = use door    |    Shift = run"
							},
							"Key": "DoomMainMenu_6"
						},
						{
							"Source":
							{
								"Text": "▶  START GAME"
							},
							"Translation":
							{
								"Text": "▶  START GAME"
							},
							"Key": "DoomMainMenu_5"
						}
					]
				},
				{
					"Namespace": "HelloWorld",
					"Children": [
						{
							"Source":
							{
								"Text": "Hello, world! (compiled from HelloWorld.uetkx)"
							},
							"Translation":
							{
								"Text": "Hello, world! (compiled from HelloWorld.uetkx)"
							},
							"Key": "HelloWorld_1"
						}
					]
				},
				{
					"Namespace": "InteropShowcase",
					"Children": [
						{
							"Source":
							{
								"Text": "All four pillars in one screen"
							},
							"Translation":
							{
								"Text": "All four pillars in one screen"
							},
							"Key": "InteropShowcase_1"
						},
						{
							"Source":
							{
								"Text": "CommonUI -- their activation driving ours:"
							},
							"Translation":
							{
								"Text": "CommonUI -- their activation driving ours:"
							},
							"Key": "InteropShowcase_6"
						},
						{
							"Source":
							{
								"Text": "MVVM -- their data inside ours:"
							},
							"Translation":
							{
								"Text": "MVVM -- their data inside ours:"
							},
							"Key": "InteropShowcase_4"
						},
						{
							"Source":
							{
								"Text": "Slate output - a UMG widget hosted inside - MVVM data feeding in - CommonUI activation"
							},
							"Translation":
							{
								"Text": "Slate output - a UMG widget hosted inside - MVVM data feeding in - CommonUI activation"
							},
							"Key": "InteropShowcase_2"
						},
						{
							"Source":
							{
								"Text": "Toggle activation"
							},
							"Translation":
							{
								"Text": "Toggle activation"
							},
							"Key": "InteropShowcase_7"
						},
						{
							"Source":
							{
								"Text": "UMG -- their widget inside ours:"
							},
							"Translation":
							{
								"Text": "UMG -- their widget inside ours:"
							},
							"Key": "InteropShowcase_3"
						},
						{
							"Source":
							{
								"Text": "viewmodel.SetInt(+1)"
							},
							"Translation":
							{
								"Text": "viewmodel.SetInt(+1)"
							},
							"Key": "InteropShowcase_5"
						}
					]
				},
				{
					"Namespace": "KeyedDiff",
					"Children": [
						{
							"Source":
							{
								"Text": "Insert new key"
							},
							"Translation":
							{
								"Text": "Insert new key"
							},
							"Key": "KeyedDiff_7"
						},
						{
							"Source":
							{
								"Text": "Keyed diff / LIS test"
							},
							"Translation":
							{
								"Text": "Keyed diff / LIS test"
							},
							"Key": "KeyedDiff_1"
						},
						{
							"Source":
							{
								"Text": "Remove middle"
							},
							"Translation":
							{
								"Text": "Remove middle"
							},
							"Key": "KeyedDiff_8"
						},
						{
							"Source":
							{
								"Text": "Reorder, insert, and remove keyed rows -- rows stay mounted while order changes."
							},
							"Translation":
							{
								"Text": "Reorder, insert, and remove keyed rows -- rows stay mounted while order changes."
							},
							"Key": "KeyedDiff_2"
						},
						{
							"Source":
							{
								"Text": "Reset"
							},
							"Translation":
							{
								"Text": "Reset"
							},
							"Key": "KeyedDiff_3"
						},
						{
							"Source":
							{
								"Text": "Reverse"
							},
							"Translation":
							{
								"Text": "Reverse"
							},
							"Key": "KeyedDiff_4"
						},
						{
							"Source":
							{
								"Text": "Rotate tail to head"
							},
							"Translation":
							{
								"Text": "Rotate tail to head"
							},
							"Key": "KeyedDiff_5"
						},
						{
							"Source":
							{
								"Text": "Shuffle"
							},
							"Translation":
							{
								"Text": "Shuffle"
							},
							"Key": "KeyedDiff_6"
						}
					]
				},
				{
					"Namespace": "LabScopeBadge",
					"Children": [
						{
							"Source":
							{
								"Text": "scope-proof"
							},
							"Translation":
							{
								"Text": "scope-proof"
							},
							"Key": "LabScopeBadge_1"
						}
					]
				},
				{
					"Namespace": "MvvmDemo",
					"Children": [
						{
							"Source":
							{
								"Text": "A URuitkSignalViewModel is written by the button; UseField re-renders on the field broadcast. They own the value; we own the structure."
							},
							"Translation":
							{
								"Text": "A URuitkSignalViewModel is written by the button; UseField re-renders on the field broadcast. They own the value; we own the structure."
							},
							"Key": "MvvmDemo_2"
						},
						{
							"Source":
							{
								"Text": "MVVM / FieldNotify -- their data feeds us"
							},
							"Translation":
							{
								"Text": "MVVM / FieldNotify -- their data feeds us"
							},
							"Key": "MvvmDemo_1"
						},
						{
							"Source":
							{
								"Text": "viewmodel.SetInt(+1)"
							},
							"Translation":
							{
								"Text": "viewmodel.SetInt(+1)"
							},
							"Key": "MvvmDemo_3"
						}
					]
				},
				{
					"Namespace": "RouterDemo",
					"Children": [
						{
							"Source":
							{
								"Text": "Router — in-memory navigation"
							},
							"Translation":
							{
								"Text": "Router — in-memory navigation"
							},
							"Key": "RouterDemo_1"
						},
						{
							"Source":
							{
								"Text": "Two routes; :id is a dynamic segment read via UseParams."
							},
							"Translation":
							{
								"Text": "Two routes; :id is a dynamic segment read via UseParams."
							},
							"Key": "RouterDemo_2"
						}
					]
				},
				{
					"Namespace": "RouterHome",
					"Children": [
						{
							"Source":
							{
								"Text": "Home — pick a user:"
							},
							"Translation":
							{
								"Text": "Home — pick a user:"
							},
							"Key": "RouterHome_1"
						},
						{
							"Source":
							{
								"Text": "Open user 42"
							},
							"Translation":
							{
								"Text": "Open user 42"
							},
							"Key": "RouterHome_2"
						},
						{
							"Source":
							{
								"Text": "Open user 7"
							},
							"Translation":
							{
								"Text": "Open user 7"
							},
							"Key": "RouterHome_3"
						}
					]
				},
				{
					"Namespace": "RouterUser",
					"Children": [
						{
							"Source":
							{
								"Text": "Back home"
							},
							"Translation":
							{
								"Text": "Back home"
							},
							"Key": "RouterUser_1"
						}
					]
				},
				{
					"Namespace": "SignalCounter",
					"Children": [
						{
							"Source":
							{
								"Text": "Decrement"
							},
							"Translation":
							{
								"Text": "Decrement"
							},
							"Key": "SignalCounter_3"
						},
						{
							"Source":
							{
								"Text": "Increment"
							},
							"Translation":
							{
								"Text": "Increment"
							},
							"Key": "SignalCounter_2"
						},
						{
							"Source":
							{
								"Text": "Reset"
							},
							"Translation":
							{
								"Text": "Reset"
							},
							"Key": "SignalCounter_4"
						},
						{
							"Source":
							{
								"Text": "Signal Counter (shared state)"
							},
							"Translation":
							{
								"Text": "Signal Counter (shared state)"
							},
							"Key": "SignalCounter_1"
						}
					]
				},
				{
					"Namespace": "SimpleCounter",
					"Children": [
						{
							"Source":
							{
								"Text": "+"
							},
							"Translation":
							{
								"Text": "+"
							},
							"Key": "SimpleCounter_2"
						},
						{
							"Source":
							{
								"Text": "+"
							},
							"Translation":
							{
								"Text": "+"
							},
							"Key": "SimpleCounter_1"
						}
					]
				},
				{
					"Namespace": "SimpleTextField",
					"Children": [
						{
							"Source":
							{
								"Text": "Type here..."
							},
							"Translation":
							{
								"Text": "Type here..."
							},
							"Key": "SimpleTextField_1"
						}
					]
				},
				{
					"Namespace": "StressTest",
					"Children": [
						{
							"Source":
							{
								"Text": "  Boxes: "
							},
							"Translation":
							{
								"Text": "  Boxes: "
							},
							"Key": "StressTest_2"
						},
						{
							"Source":
							{
								"Text": "Duration(s): "
							},
							"Translation":
							{
								"Text": "Duration(s): "
							},
							"Key": "StressTest_1"
						}
					]
				},
				{
					"Namespace": "StyledPanels",
					"Children": [
						{
							"Source":
							{
								"Text": "Styled panels"
							},
							"Translation":
							{
								"Text": "Styled panels"
							},
							"Key": "StyledPanels_1"
						},
						{
							"Source":
							{
								"Text": "dim the mirror"
							},
							"Translation":
							{
								"Text": "dim the mirror"
							},
							"Key": "StyledPanels_2"
						}
					]
				},
				{
					"Namespace": "TicTacToe",
					"Children": [
						{
							"Source":
							{
								"Text": "Draw!"
							},
							"Translation":
							{
								"Text": "Draw!"
							},
							"Key": "TicTacToe_2"
						},
						{
							"Source":
							{
								"Text": "Welcome to Tic Tac Toe!"
							},
							"Translation":
							{
								"Text": "Welcome to Tic Tac Toe!"
							},
							"Key": "TicTacToe_1"
						}
					]
				},
				{
					"Namespace": "UmgHostDemo",
					"Children": [
						{
							"Source":
							{
								"Text": "1. OUR UI INSIDE THEIRS -- URuitkHostWidget in a hand-built UserWidget:"
							},
							"Translation":
							{
								"Text": "1. OUR UI INSIDE THEIRS -- URuitkHostWidget in a hand-built UserWidget:"
							},
							"Key": "UmgHostDemo_2"
						},
						{
							"Source":
							{
								"Text": "2. THEIR VIEW ON OUR STATE -- a UMG TextBlock FieldNotify-bound to our viewmodel:"
							},
							"Translation":
							{
								"Text": "2. THEIR VIEW ON OUR STATE -- a UMG TextBlock FieldNotify-bound to our viewmodel:"
							},
							"Key": "UmgHostDemo_3"
						},
						{
							"Source":
							{
								"Text": "UMG -- the door's second direction, and the reverse MVVM bridge"
							},
							"Translation":
							{
								"Text": "UMG -- the door's second direction, and the reverse MVVM bridge"
							},
							"Key": "UmgHostDemo_1"
						},
						{
							"Source":
							{
								"Text": "our code writes: viewmodel.SetInt(+1)"
							},
							"Translation":
							{
								"Text": "our code writes: viewmodel.SetInt(+1)"
							},
							"Key": "UmgHostDemo_4"
						}
					]
				},
				{
					"Namespace": "UmgHostInner",
					"Children": [
						{
							"Source":
							{
								"Text": "+1"
							},
							"Translation":
							{
								"Text": "+1"
							},
							"Key": "UmgHostInner_2"
						},
						{
							"Source":
							{
								"Text": "▼ Reactive UI Toolkit again — mounted INSIDE that UMG widget by URuitkHostWidget"
							},
							"Translation":
							{
								"Text": "▼ Reactive UI Toolkit again — mounted INSIDE that UMG widget by URuitkHostWidget"
							},
							"Key": "UmgHostInner_1"
						}
					]
				}
			]
		}
	]
}